/*
//1.计算1~100之间所有整数的和，一旦总和超过4000，强制结束循环，并打印结果
for(var i=1,sum=0;i<=100;i++){
  sum+=i;
  //一旦sum超过4000，强制结束循环
  if(sum>4000){
    break;
  }
}
console.log(sum,i);

//2.使用循环打印出本世纪（2000~2100）的前10个闰年
//声明变量记录闰年的个数
var count=0;
var i=2000;
for(;i<=2100;i++){
  //判断是否为闰年
  if(i%4===0 && i%100!==0 || i%400===0){
    console.log(i);
	//如果是闰年，闰年的个数加1
	count++;
    //闰年的个数每次加1，判断是否为10，如果是10强制结束循环
	if(count===10){
	  break;
	}
  }
}
console.log(count);
*/

//3.使用循环嵌套打印九九乘法表
/*
''
1*1=1   <=1
''
1*2=2 2*2=4  <=2
''
1*3=3 2*3=6 3*3=9  <=3
*/
//外层循环：控制循环的行数 i, 1~9
for(var i=1;i<=9;i++){
  //内层循环：控制每行循环的列数 j
  //每一行的循环条件是由所在的行决定
  for(var j=1,str='';j<=i;j++){
    //把产生的列拼接到一起
	str+=j+'*'+i+'='+(i*j)+' ';
  }
  //当一行拼接结束，打印这一行
  console.log(str);
}





/*
9*9=81 8*9=72.. 1*9=1
8*8=64
..
1*1
*/












