/*
//变量交换
var a=1;
var b=2;
//第3个变量把a提前保存
var c=a;
a=b;
b=c;
console.log(a,b);
*/
//练习：创建函数，传递一个参数(为任意一项)，在函数中返回该项对应的值
function fib(n){
  //第1项和第2项都是1
  var n1=1,n2=1;
  //如果要求第n项的值，只需要让n1和n2挪动到该项，结束后n2就是所求项的值
  //每次挪动是从第3项开始  范围3~n
  for(var i=3;i<=n;i++){
    //循环体，就是中间n1，n2不断往后挪动的过程
	//每次挪动，n1的值是上一次n2的值，n2的值是上一次n1和n2相加的值
	var c=n1;
	n1=n2;
	n2=c+n2;
  }
  //n2的值就是所求项的值
  return n2;
}
//console.log( fib(60) );
//递归：在函数内调用自身函数
//第n项的值=第n-1项值+第n-2项的值
//fib2(n)
//第1,2项固定是1
function fib2(n){
  //当n是1或者2的时候，直接返回1
  if(n===1 || n===2){
    return 1;//返回1，同时结束函数调用
  }
  //其它项的值是前两项相加的和
  return fib2(n-1)+fib2(n-2);
}
console.log( fib2(50) );
/*
fib2(4)+fib2(3)
fib2(3)+fib2(2)+fib2(2)+fib2(1)
fib2(2)+fib2(1)+fib2(2)+fib2(2)+fib2(1)
1+1+1+1+1
*/






